note/note-disk_mount.org
#+TITLE: 磁盘挂载那些事
* TODO 本地盘挂载
  - State "TODO"       from              [2018-11-13 Tue 19:38]

   在文件中添加要挂载的分区和文件目录可以修改配置 =/etc/fstab=
   然后手动 =mount -a= 挂载即可

   : /dev/sda5/    media/win    ntfs    defaults   02


   1. 查看几块硬盘
   
      sudo fdisk -l |grep sd
   
   2. 创建分区
   
      虚拟机现有20g的硬盘,使用fdisk划分磁盘
       
      sudo fdisk /dev/sda
   
      #+BEGIN_VERSE
         m  帮助信息  
         n 创建分区
         e 扩展分区    +5G  pppp/pppe
         p 打印分区
         t 分区类型 L  (lvm)
         w 写入保存分区
      #+END_VERSE

   3. 格式化 分区

   - LVM
     pv --> vg --> lv
     参考: http://blog.sina.com.cn/s/blog_b77735d20101e5cn.html
     http://aurthurxlc.github.io/Aurthur-2017/Centos-7-extend-lvm-volume.html

  fdisk -l | grep sd
  fdisk /dev/sda
  partprobe
  pvdisplay
  pvcreate /dev/sda3
  vgdisplay
  vgextend centos /dev/sda3
  lvdisplay
  lvcreate -L 3.31G -n manue1 centos
  mkfs.xfs /dev/centos/manue1
  lvremove -f /dev/centos/manue1
  lvextend -l +100%FREE /dev/centos/root
  df -Th
  xfs_growfs /dev/centos/root
* DONE 远程盘挂载
  CLOSED: [2018-12-30 Sun 17:28]
  - State "DONE"       from "TODO"       [2018-12-30 Sun 17:28]
  - State "TODO"       from              [2018-11-13 Tue 19:37]
    
  *nfs服务磁盘挂载*

  http://www.netingcn.com/centos-nfs-config.html

  - server 端
    
    需要共享出去的目录添加在/etc/exports文件中，格式为
    
    服务器上共享的目录  客户端主机名称1或IP1(参数1,参数2) 客户端主机名称2或IP2(参数3,参数4)

    =/home/data/ client-ip (rw,sync,no_root_squash)=
    
    =service nfs restart= 重启nfs

    =exportfs -v= 查看共享的目录

    

  - client 端

    客户端挂载本地目录
    =mount -t nfs server-ip:/home/data /home/apps/update_package/=

    =umount /xxx/=

    =vim /etc/rc.local= 添加到开机自启动内

    
    

    