note/note-disk_mount.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2019-01-24 Thu 21:14 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>磁盘挂载那些事</title>
<meta name="generator" content="Org mode">
<meta name="author" content="manue1">
<link rel="stylesheet" type="text/css" href="css/worg.css" />
<!-- <link rel="shortcut icon" href="http://www.langdebuqing.com/images/favicon.ico" type="image/x-icon" /> -->
</head>
<body>
<div id="preamble" class="status">
<div id="navbar">
    <ul>
        <li id="site-master"><a href="https://www.manue1.site/">Manue1's Journal</a></li>
        <li><a class="navbar-item" href="https://www.manue1.site/write.html">All Posts</a> </li>
        <li><a class="navbar-item" href="https://www.manue1.site/link.html">Links</a> </li>
        <li class="search">
            <form action="http://google.com/search" method="get" accept-charset="utf-8">
                <input type="search" id="search" name="q" autocomplete="off" maxlength="30" placeholder="Search..">
                <input type="hidden" name="q" value="site:www.manue1.com">
            </form>
        </li>
    </ul>
</div>
</div>
<div id="content">
<h1 class="title">磁盘挂载那些事</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8bd2bc3">1. <span class="todo TODO">TODO</span> 本地盘挂载</a></li>
<li><a href="#orga881147">2. <span class="done DONE">DONE</span> 远程盘挂载</a></li>
</ul>
</div>
</div>
<div id="outline-container-org8bd2bc3" class="outline-2">
<h2 id="org8bd2bc3"><span class="section-number-2">1</span> <span class="todo TODO">TODO</span> 本地盘挂载</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><p>
State "TODO"       from              <span class="timestamp-wrapper"><span class="timestamp">[2018-11-13 Tue 19:38]</span></span><br>
</p>

<p>
在文件中添加要挂载的分区和文件目录可以修改配置 <code>/etc/fstab</code><br>
然后手动 <code>mount -a</code> 挂载即可<br>
</p>

<pre class="example">
/dev/sda5/    media/win    ntfs    defaults   02

</pre></li>
</ul>


<ol class="org-ol">
<li><p>
查看几块硬盘<br>
</p>

<p>
sudo fdisk -l |grep sd<br>
</p></li>

<li><p>
创建分区<br>
</p>

<p>
虚拟机现有20g的硬盘,使用fdisk划分磁盘<br>
</p>

<p>
sudo fdisk /dev/sda<br>
</p>

<p class="verse">
m  帮助信息<br>
n 创建分区<br>
e 扩展分区    +5G  pppp/pppe<br>
p 打印分区<br>
t 分区类型 L  (lvm)<br>
w 写入保存分区<br>
</p></li>

<li>格式化 分区<br></li>

<li>LVM<br>
pv &#x2013;&gt; vg &#x2013;&gt; lv<br>
参考: <a href="http://blog.sina.com.cn/s/blog_b77735d20101e5cn.html">http://blog.sina.com.cn/s/blog_b77735d20101e5cn.html</a><br>
<a href="http://aurthurxlc.github.io/Aurthur-2017/Centos-7-extend-lvm-volume.html">http://aurthurxlc.github.io/Aurthur-2017/Centos-7-extend-lvm-volume.html</a><br></li>
</ol>

<p>
fdisk -l | grep sd<br>
fdisk /dev/sda<br>
partprobe<br>
pvdisplay<br>
pvcreate /dev/sda3<br>
vgdisplay<br>
vgextend centos /dev/sda3<br>
lvdisplay<br>
lvcreate -L 3.31G -n manue1 centos<br>
mkfs.xfs /dev/centos/manue1<br>
lvremove -f /dev/centos/manue1<br>
lvextend -l +100%FREE /dev/centos/root<br>
df -Th<br>
xfs_growfs /dev/centos/root<br>
</p>
</div>
</div>
<div id="outline-container-orga881147" class="outline-2">
<h2 id="orga881147"><span class="section-number-2">2</span> <span class="done DONE">DONE</span> 远程盘挂载</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>State "DONE"       from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2018-12-30 Sun 17:28]</span></span><br></li>
<li>State "TODO"       from              <span class="timestamp-wrapper"><span class="timestamp">[2018-11-13 Tue 19:37]</span></span><br></li>
</ul>

<p>
<b>nfs服务磁盘挂载</b><br>
</p>

<p>
<a href="http://www.netingcn.com/centos-nfs-config.html">http://www.netingcn.com/centos-nfs-config.html</a><br>
</p>

<ul class="org-ul">
<li><p>
server 端<br>
</p>

<p>
需要共享出去的目录添加在/etc/exports文件中，格式为<br>
</p>

<p>
服务器上共享的目录  客户端主机名称1或IP1(参数1,参数2) 客户端主机名称2或IP2(参数3,参数4)<br>
</p>

<p>
<code>/home/data/ client-ip (rw,sync,no_root_squash)</code><br>
</p>

<p>
<code>service nfs restart</code> 重启nfs<br>
</p>

<p>
<code>exportfs -v</code> 查看共享的目录<br>
</p></li>
</ul>



<ul class="org-ul">
<li><p>
client 端<br>
</p>

<p>
客户端挂载本地目录<br>
<code>mount -t nfs server-ip:/home/data /home/apps/update_package/</code><br>
</p>

<p>
<code>umount /xxx/</code><br>
</p>

<p>
<code>vim /etc/rc.local</code> 添加到开机自启动内<br>
</p></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p>
    <a href="">manue1</a> 搭建和维护，使用
    <a href="https://www.gnu.org/software/emacs/">Emacs</a>
    <a href="http://orgmode.org/">Org mode</a> 编辑和构建
</p>
<script src="http://www.langdebuqing.com/css/jquery-2.1.3.min.js"></script>
<script src="http://www.langdebuqing.com/css/main.js"></script>
</div>
</body>
</html>